--COPY THAT ALL

--отредактируй, сколько от и до секунд будет рандомная фигня
local ot = 15 --от скольки секунд будет происходить эвент
local to = 40 --до скольки секунд будет происходить эвент
--[[
СКРИПТ НА РАНДОМНЫЙ ЭВЕНТ
КАЖДЫЕ <настроено> СЕКУНД БУДЕТ ПРОИСХОДИТЬ ЛЮБОЙ ЭВЕНТ
ЭВЕНТЫ
1.присядь
2.ты не можешь прыгать - вовсе
3.ты игвалид на коляске
4.нечего
5.слепота - создаётся тёмная атмосфера, коротко слепота
6.потеря инвентаря - инвентарь удаляется
7.го почилим - ты на время телепортируешься наверх на 200 студов и замераешь на 10 секунд
8.уфф - если найдёт в гуманоидрутпарте звук смерти, воспроизводит его
9.курсор на своём - курсор жёстко дрыгает
10.молния - создаётся новый звук айди молнии возпроизводит его и после окончания удаляет звук
11.создаёт музыку, а если музыка уже есть удаляет её и создаёт новый
12.esp других игроков на 5 секунд
]]











































print(ot)
print(to)
local player = game:GetService("Players").LocalPlayer
print(player)
local charecter = player.Character
print(charecter)
local humanoid = charecter:FindFirstChild("Humanoid")
print(humanoid)

game:GetService("StarterGui"):SetCore("SendNotification", { 
    Title = "RandomModification by Viktor188834";
    Text = "RandomModification by Viktor188834";
    Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})

local MainGui = Instance.new("ScreenGui")
MainGui.Name = "RandomModification"
MainGui.ResetOnSpawn = false
MainGui.Parent = player:WaitForChild("PlayerGui")

local SecondText = Instance.new("TextLabel")
SecondText.Parent = MainGui
SecondText.Position = UDim2.new(0.143, 0, 0.90000, 0)
SecondText.Name = "Modification"
SecondText.Text = "nothing"
SecondText.TextSize = 32
SecondText.TextColor3 = Color3.fromRGB(240, 240, 240)
SecondText.BackgroundTransparency = 1

local FirstText = Instance.new("TextLabel")
FirstText.Parent = MainGui
FirstText.Position = UDim2.new(0.5, 0, 0.0210000, 0)
FirstText.Name = "Notification"
FirstText.Text = " "
FirstText.TextSize = 32
FirstText.TextColor3 = Color3.fromRGB(100, 125, 125)
FirstText.BackgroundTransparency = 1

local atmosphera = Instance.new("Atmosphere")
atmosphera.Parent = game:GetService("Lighting")
atmosphera.Name = "atmosphera"
atmosphera.Density = 0.03

function RandomS()
	humanoid.JumpPower = 50
	humanoid.WalkSpeed = 16
	atmosphera.Density = 0
	atmosphera.Color = Color3.fromRGB(240, 240, 240)
	local RandomDoing = math.random(1, 13)
	if RandomDoing == 1 then
		FirstText.Text = "SIT DOWN!!!"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "sit down";
    		Text = "сядь на хуй";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		humanoid.Sit = true
		SecondText.Text = "sit down"
		wait(3)
		FirstText.Text = " "
	elseif RandomDoing == 2 then
		FirstText.Text = "NOW YOU CAN'T JUMP!!1!"
		humanoid.JumpPower = 0
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "skiping day of legs";
    		Text = "пропускал день ног";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "without jumps"
		wait(3)
		FirstText.Text = " "
	elseif RandomDoing == 3 then
		FirstText.Text = "whoever moves first is gay"
		humanoid.WalkSpeed = 0
		SecondText.Text = "without WalkSpeed"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "whoever moves first is gay";
    		Text = "кто первый двинется тот гей";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		wait(3)
		FirstText.Text=" "
	elseif RandomDoing == 4 then
		FirstText.Text = "what are you want?"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "what are you want?";
    		Text = "что ты хочешь?";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "nothing"
		wait(3)
		FirstText.Text=" "
	elseif RandomDoing == 5 then
		FirstText.Text = "i can't see"
		atmosphera.Parent = game:GetService("Lighting")
		atmosphera.Name = "atmosphera"
		atmosphera.Density = 0.75
		atmosphera.Offset = 0.4
		atmosphera.Color = Color3.fromRGB(0, 0, 0)
		atmosphera.Decay = Color3.fromRGB(0, 0, 0)
		atmosphera.Haze = 10
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "i can't see";
    		Text = "я не чего не вижу";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "you can't see"
		wait(3)
		FirstText.Text = " "
	elseif RandomDoing == 6 then
		FirstText.Text = "Backpack lost"
		player.Backpack:Destroy()
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "Backpack was lost(";
    		Text = "рюкзак проебал";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "Backpack Was lost"
		wait(3)
		FirstText.Text=" "
	elseif RandomDoing == 7 then
		FirstText.Text = "Let's chilling!"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "Let's chill!";
    		Text = "го почилим";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "ChillGuy"
		local humanoidrotpart = charecter.HumanoidRootPart
		wait(3)
		FirstText.Text=" "
		humanoidrotpart.CFrame = humanoidrotpart.CFrame + Vector3.new(0, 200, 0)
		humanoidrotpart.Anchored = true
		wait(10)
		humanoidrotpart.Anchored = false
		humanoidrotpart.CFrame = humanoidrotpart.CFrame + Vector3.new(0, -199, 0)
	elseif RandomDoing == 8 then
		FirstText.Text = "uff"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
			Title = "UFF";
			Text = "уфф";
			Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "Sound"
		local uff = humanoidrotpart:FindFirstChild("Died")
		uff.Volume = 1
		uff.TimePosition = 0
		uff.Playing = true
		wait(0.460)
		uff.Playing = false
		wait(3)
		FirstText.Text=" "
	elseif RandomDoing == 9 then
		FirstText.Text = "lol with Cursor"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "lol with cursor";
    		Text = "полный хаос с курсором";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "nothing"
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		mousemoveabs(math.random(-900, 900), math.random(-900, 900))
		wait(math.random(0.50,1.5))
		FirstText.Text=" "
	elseif RandomDoing == 10 then
		FirstText.Text = "storm"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "storm";
    		Text = "молния";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "storm"
		FirstText.Text=" "
		local stormmm = Instance.new("Sound")
		stormmm.Parent = workspace
		stormmm.Name = "suicide"
		stormmm.SoundId = "rbxassetid://224339201"
		stormmm.Volume = 1
		stormmm.TimePosition = 0
		stormmm.Playing = true
		wait(3.563)
		stormmm.Playing = false
		stormmm:Destroy()
		FirstText.Text=" "
	elseif RandomDoing == 11 then
		local myMusic = workspace:FindFirstChild("Music")
		myMusic:Destroy()
		FirstText.Text = "Music"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "Music";
    		Text = "молния";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "Music"
		local Music = Instance.new("Sound")
		Music.Parent = workspace
		Music.Name = "Music"
		Music.SoundId = "rbxassetid://1846178770"
		Music.Volume = 0.8
		Music.TimePosition = 0
		Music.Playing = true
		FirstText.Text=" "
	elseif RandomDoing == 12 then
		FirstText.Text = "ESP!"
		game:GetService("StarterGui"):SetCore("SendNotification", { 
   			Title = "ESP";
    		Text = "ESP other players";
    		Icon = "rbxthumb://type=Asset&id=5107182114&w=150&h=150"})
		SecondText.Text = "esp"
		wait(3)
		FirstText.Text=" "
		for i, childrik in ipairs(workspace:GetDescendants()) do
    		if childrik:FindFirstChild("Body Colors") then
    			if not childrik:FindFirstChild("EspBox") then
         			if childrik ~= game.Players.LocalPlayer.Character then
             			local esp = Instance.new("Highlight",childrik)
            			esp.Name = "EspBox"
						esp.FillColor = Color3.fromRGB(255, 0, 0)
						esp.OutlineTransparency = 0.3
						wait(10)
						esp:Destroy()
    	    		end
				end
			end
		end
	elseif RandomDoing == 13 then
		--[[ v1.0.0 https://wearedevs.net/obfuscator ]] return(function(...)local J={"\049\067\122\051\073\106\076\068","\048\115\119\111\066\075\052\121\100\065\048\047\110\077\061\061";"\090\056\101\056\077\111\080\100\084\070\083\119\099\109\101\061";"\086\057\108\116\122\112\080\061";"\084\097\043\101\050\074\120\083\076\118\090\061","\111\076\118\117";"\109\051\118\117\049\090\061\061";"\087\099\116\115\087\097\069\121\073\067\049\061","\099\117\079\110\049\054\048\116\073\077\061\061";"\101\084\068\080\076\090\061\061","\115\103\084\073\101\087\068\043\090\103\089\054\116\079\076\116\074\086\108\057\113\101\090\061";"\089\099\122\115\087\097\069\111\088\090\061\061","\112\103\110\120","\073\054\112\120\111\099\067\087\111\076\110\053\049\082\061\061";"\052\098\047\051\089\067\109\078\054\107\061\061";"\071\071\121\066\076\066\076\069\102\067\076\083\117\115\090\106\102\043\090\061","\117\119\077\061","\097\070\110\043\081\085\086\050\118\113\113\061";"\087\099\112\083\073\099\071\061","\111\053\116\066\050\107\080\061";"\117\122\056\106\050\071\122\070\117\112\049\055\108\075\068\085\050\112\104\061";"\085\100\055\074\109\077\061\061";"\049\056\085\057\050\090\061\061";"\101\070\043\048\118\082\061\061";"\053\080\076\066\102\105\121\075\102\075\119\055\089\066\121\070","\049\099\053\065\073\099\077\061";"\122\099\112\051\049\099\122\109\104\098\089\068\087\099\122\075\087\099\122\119\104\090\061\061","\072\090\081\119\079\049\071\085\101\119\049\061";"\066\087\068\098\120\075\072\106\101\101\074\080\087\077\061\061";"\118\052\122\056\104\098\075\115\118\085\113\083";"\073\099\122\065\087\067\071\061";"\097\081\066\104";"\101\048\065\065\049\082\061\061","\076\119\089\100\122\068\108\109\088\068\087\099\081\048\053\080\089\082\061\061";"\069\100\117\117\088\088\106\043\056\083\080\086\109\090\113\117";"\087\097\054\083\083\067\105\108\047\053\068\075\105\121\083\084\122\082\090\121\080\077\072\084\081\101\101\077\065\077\061\061";"\084\078\072\067\073\077\061\061","\114\043\113\109","\102\078\087\112\116\050\099\117\081\097\057\105","\101\048\116\118\101\048\112\080";"\076\048\112\051\076\090\061\061";"\115\082\066\053\055\119\067\056\050\054\115\057\115\082\107\085\048\106\084\051\098\068\098\056\051\049\071\061","\055\069\100\082\077\052\076\114\079\075\101\061","\117\098\051\085";"\081\075\054\054\082\111\100\112\109\070\113\061";"\043\105\116\084\101\077\061\061";"\073\099\122\118","\075\086\102\043\055\090\100\102\073\076\106\067","\043\105\116\070\076\066\057\061";"\069\077\082\116\053\121\050\089","\122\105\104\105\102\106\068\110\071\119\116\110\053\075\065\054\122\119\114\070","\072\102\087\056";"\081\055\121\106\083\100\097\057\116\081\082\061","\076\048\105\065\087\099\053\113";"\111\117\070\100\105\082\061\061","\122\071\089\121\073\081\104\061","\116\113\057\080","\080\052\072\085\069\077\061\061";"\087\066\114\077\101\066\053\110","\106\084\089\116\048\090\061\061","\089\078\055\106\068\047\090\113\077\088\117\065\057\090\061\061","\108\118\080\108\076\100\112\122","\050\083\082\068\076\100\113\121\050\082\061\061","\073\083\043\110\114\085\082\118\069\077\061\061";"\085\112\121\099\118\071\122\056";"\122\111\052\106\049\068\113\078";"\080\104\098\090\074\110\066\114";"\077\110\121\083\097\053\071\111\085\101\115\065";"\078\075\056\086","\103\087\090\108\121\110\077\071\074\087\113\081\105\051\106\086\067\068\102\078\112\090\061\061";"\048\116\068\079\056\107\061\061";"\065\068\072\099\080\107\061\061";"\106\098\116\071\086\071\077\048\113\117\074\104\087\082\061\061";"\082\097\100\101\116\070\085\115\102\107\061\061","\102\075\069\055\081\043\112\072\101\068\056\085\101\048\122\055\087\105\090\061","\043\105\116\121\073\067\089\068\088\107\061\061";"\089\097\097\057","\086\057\119\089\080\079\110\076\057\090\061\061";"\053\104\070\065\115\077\061\061","\111\109\113\111\105\107\117\109\122\090\061\061";"";"\120\080\072\118\065\084\043\106\078\082\061\061","\050\082\061\061";"\082\120\097\053\071\054\087\107\121\099\108\065\109\069\120\075\065\089\102\047\066\082\061\061","\089\067\068\118\076\112\053\068\049\084\076\121\101\048\071\061";"\106\118\109\090";"\113\085\105\117\111\072\122\084\051\083\053\071","\076\067\055\111\073\106\104\061","\075\101\106\071";"\119\048\073\086\079\122\066\085\055\119\085\065\102\118\055\110\116\110\085\057\090\050\053\120\057\111\069\055\070\052\107\073\078\067\054\079\052\114\048\078\056\066\068\077\101\068\121\069\075\088\049\088\047\110\068\054\097\097\107\078\070\117\054\077\112\088\070\043","\101\056\119\120","\108\085\050\083\071\077\061\061";"\122\071\048\079\104\054\087\100\056\103\119\061","\055\073\043\107\106\083\048\056\114\107\061\061","\105\098\109\055\049\108\055\048\050\115\106\116\097\077\061\061";"\053\082\118\113\071\122\057\097\107\102\070\113","\100\047\085\077\113\077\061\061","\108\115\076\075\117\075\108\068","\073\054\098\061","\049\122\069\119\073\099\076\069\081\106\053\118\049\071\122\072\076\082\061\061","\080\103\101\115\074\071\057\055\105\069\047\083","\048\086\116\116\088\089\117\047\065\105\082\061";"\110\051\086\089\114\113\053\100\054\122\043\090","\090\082\087\108","\087\099\116\118\087\066\105\083\076\043\104\061","\117\066\114\115\087\099\112\118\101\048\071\061";"\071\051\054\082\104\043\066\070\076\107\061\061";"\090\048\116\070\073\106\104\115","\069\072\071\097\109\051\048\081\057\090\061\061","\067\103\043\108\085\098\069\090\100\090\061\061";"\083\073\103\097\069\121\085\098\113\055\084\049\083\073\048\050\070\082\088\043","\074\099\080\076\098\051\112\049\115\069\082\061","\104\116\086\072\048\082\061\061";"\051\111\101\113\103\118\055\105";"\076\043\069\109\073\106\104\061","\108\112\043\065\072\076\056\098\090\054\050\099\088\111\070\061";"\088\116\079\053","\051\103\104\097\077\068\085\043\074\068\113\061";"\072\102\106\108\053\087\069\047","\057\084\107\065\115\117\049\097\101\080\054\100\115\107\061\061";"\049\077\108\107\087\109\049\061","\113\051\109\072\057\049\114\108\078\070\086\054\084\052\108\120\065\111\110\054\120\072\113\061";"\065\107\116\052\051\113\088\065\111\100\103\068\104\078\101\074";"\053\104\116\052\101\090\061\061","\049\106\089\109\102\066\114\084","\070\116\054\043\056\118\119\072\083\110\107\061","\053\084\087\057\053\066\101\048\053\043\090\105\122\098\076\084\087\090\061\061","\069\086\067\068","\049\067\112\118\076\099\116\051";"\109\076\073\066\099\090\061\061";"\073\098\122\101\102\119\089\084\049\054\069\098\122\122\065\084";"\076\099\077\106\122\066\057\114\071\066\053\089\053\099\121\085","\070\066\102\078","\110\086\079\082\108\111\067\086\066\077\061\061";"\072\072\047\104\047\076\098\043\075\076\049\061","\073\066\112\080\102\107\061\061";"\069\081\104\105","\075\048\121\069\054\113\067\088";"\049\048\122\080\073\066\122\080\101\043\089\065\101\067\055\068";"\097\079\068\072","\043\105\116\051\076\043\089\065\087\099\112\083\073\099\071\061";"\074\082\070\049\078\103\119\115";"\071\099\106\114\074\082\061\061","\076\073\111\120\043\057\101\112\104\082\061\061","\106\085\088\104\113\077\061\061","\089\048\122\080\071\048\122\109\087\067\068\075\076\090\061\061","\112\106\067\071\098\072\101\085\119\069\108\061","\071\121\087\066\052\049\108\061";"\049\079\100\108\076\113\113\061";"\089\068\117\100\066\048\076\043";"\054\067\107\043";"\111\106\084\048\052\077\061\061";"\079\054\087\052","\101\122\104\115\102\099\114\048\108\080\089\117\088\066\089\072\081\054\107\061","\077\104\074\118\090\090\061\061","\076\067\069\076\049\099\116\043\053\090\061\061","\078\110\084\104\070\107\061\061";"\049\118\111\107\117\072\104\051\113\073\103\120\121\086\101\054\054\112\121\056";"\050\116\121\115\043\103\097\066","\086\065\090\065\110\071\110\120\043\107\061\061";"\043\074\083\104\065\066\097\052\121\116\047\111\118\066\110\055\071\067\087\099\104\107\061\061","\116\085\101\099";"\073\054\104\061";"\120\101\118\055\116\116\087\078\115\056\080\061";"\080\104\071\047";"\090\048\116\118\073\067\122\075\087\107\061\061";"\087\098\049\055\053\112\112\071\102\066\112\054\108\097\053\056\108\054\104\061";"\077\048\083\076\118\049\065\072\076\054\108\107\053\107\061\061";"\053\097\080\103\056\090\061\061";"\050\108\074\085\043\071\117\081","\090\103\109\050\121\110\050\087\108\101\107\061";"\101\068\101\102","\081\043\065\105\076\090\061\061","\055\121\113\098";"\076\106\053\105\101\082\061\061";"\122\115\066\090\080\053\115\067\055\112\098\061";"\071\100\067\084\099\077\061\061","\117\081\112\105\122\112\108\080\088\075\122\105\088\112\053\050";"\049\067\073\110\100\082\061\061"}for D,V in ipairs({{-661284+661285,1010477-1010298},{-557950-(-557951);-410804+410852};{-644136-(-644185);-574474-(-574653)}})do while V[-836571+836572]<V[70342+-70340]do J[V[-573914-(-573915)]],J[V[-882853-(-882855)]],V[473100-473099],V[-480008+480010]=J[V[840361-840359]],J[V[875429+-875428]],V[1010882-1010881]+(-221785-(-221786)),V[57036+-57034]-(-721604-(-721605))end end local function D(D)return J[D+(289989-285307)]end do local D=type local V={W=-23748-(-23777),I=-815869+815896,["\049"]=-544412+544440,t=503463-503402,["\050"]=-1026289+1026303,F=892645+-892601,z=928336+-928315,o=-942513+942560;r=-46342-(-46399);a=991388+-991381;w=390789-390753,c=-823443+823449,["\052"]=-229076+229138,f=502506+-502480;K=229516+-229481;h=-734471+734479,Y=-1002373-(-1002390);g=528992-528934,l=-396935+396947,v=640994+-640948,V=-660044+660059,R=-47798-(-47830);G=-121426+121446,x=287090+-287059,["\043"]=-996599+996622,d=-892436+892438,e=777272-777248,L=-11540-(-11565);D=-467899-(-467936),i=47427+-47374;["\048"]=-834394-(-834448),M=7687-7639;n=599306-599263;["\055"]=295979-295930;Z=1012403+-1012387;["\051"]=-43360-(-43405),C=-764192-(-764230);j=340608+-340553,U=-183148+183159;A=-31922+31955;N=-972395+972458,T=396151+-396112;O=-799039-(-799099),["\057"]=-347795-(-347851),P=261485-261433;m=984094-984044;y=530203-530162;H=1015728-1015718;B=-420267-(-420289);Q=-658570-(-658589),b=412834+-412830;q=-589561-(-589601);["\047"]=-607381-(-607440);J=-698925+698967;["\056"]=-913825-(-913826),k=527633-527633,p=-189178+189183;S=1023370+-1023336,s=160418+-160367;u=94267+-94249,E=-33529-(-33538),X=-1027185-(-1027215),["\053"]=-420133+420146;["\054"]=25177-25174}local t=string.len local G=math.floor local Q=table.concat local c=table.insert local H=string.sub local i=string.char local C=J for J=617701+-617700,#C,-473806+473807 do local j=C[J]if D(j)=="\115\116\114\105\110\103"then local D=t(j)local z={}local a=434966-434965 local e=998561+-998561 local h=-808455+808455 while a<=D do local J=H(j,a,a)local t=V[J]if t then e=e+t*(-587204-(-587268))^((837098-837095)-h)h=h+(195686-195685)if h==223001-222997 then h=647005-647005 local J=G(e/(32310+33226))local D=G((e%(296372-230836))/(860373+-860117))local V=e%(-333681-(-333937))c(z,i(J,D,V))e=-82728-(-82728)end elseif J=="\061"then c(z,i(G(e/(447604+-382068))))if a>=D or H(j,a+(-127623-(-127624)),a+(571436-571435))~="\061"then c(z,i(G((e%(294482-228946))/(-638289+638545))))end break end a=a+(-90079+90080)end C[J]=Q(z)end end end return(function(J,t,G,Q,c,H,i,x,o,g,e,w,a,P,C,s,h,z,V,j)j,z,g,o,w,a,P,s,e,x,C,V,h={},function()a=(-191007-(-191008))+a j[a]=-434996-(-434997)return a end,function(J,D)local t=e(D)local G=function(...)return V(J,{...},D,t)end return G end,function(J,D)local t=e(D)local G=function(G)return V(J,{G},D,t)end return G end,function(J,D)local t=e(D)local G=function(G,Q,c)return V(J,{G;Q;c},D,t)end return G end,-1025413-(-1025413),function(J,D)local t=e(D)local G=function(G,Q,c,H)return V(J,{G;Q,c,H},D,t)end return G end,function(J,D)local t=e(D)local G=function(G,Q,c,H,i)return V(J,{G,Q,c,H;i},D,t)end return G end,function(J)for D=299849-299848,#J,-455573+455574 do j[J[D]]=(-407527-(-407528))+j[J[D]]end if G then local V=G(true)local t=c(V)t[D(-197603-(-193045))],t[D(-743739+739151)],t[D(720325-724910)]=J,h,function()return-534258+-2082198 end return V else return Q({},{[D(-962646+958058)]=h,[D(-397083-(-392525))]=J;[D(313593-318178)]=function()return 188963+-2805419 end})end end,function(J)j[J]=j[J]-(901693+-901692)if j[J]==322338-322338 then j[J],C[J]=nil,nil end end,{},function(V,G,Q,c)local T,l,n,k,I,i,m,h,N,d,e,b,f,K,a,S,y,Z,U,L,g,X,v,B,R,A,F,p,E,W,j,M,q,O while V do if V<906965+8591981 then if V<-706045+6275207 then if V<1034497+2103285 then if V<-325302+2288332 then if V<1886007-344190 then if V<591816+697038 then if V<-773482+1864488 then V=3593359-(-45560)else M=nil M=D(-64440+59763)A=x(A)k=nil T=x(T)y=x(y)X=nil p=nil f=nil A=D(880517+-885194)a=x(a)g=x(g)d=nil e=x(e)h=x(h)h=z()U=x(U)e=nil V=8698416-701236 a=nil C[h]=a f=z()y=z()a=z()C[a]=e g=J[M]M=D(243223+-247769)d=D(-805394-(-800779))X=216818+-216817 e=g[M]g=z()C[g]=e M=J[A]A=D(95547+-100052)e=M[A]p={}U=D(807172+-811681)A=J[d]d=D(974208-978841)M=A[d]d=J[U]U=D(-53814-(-49213))A=d[U]d=232245-232245 U=z()C[U]=d d=1017705+-1017703 T=554445+-554189 C[y]=d d={}l=T T=-247488+247489 k={}C[f]=k k=-88598+88598 L=T T=-615794-(-615794)E=L<T T=X-L end else i=D(81043-85693)j=D(-62861-(-58326))V=J[i]i=J[j]j=D(188417+-192952)J[j]=V j=D(727245+-731895)J[j]=i j=C[Q[-401316+401317]]a=j()V=-496008+14938452 end else if V<-688052+2409012 then e=D(-363518+358903)a=J[e]V=J[D(-932451-(-927948))]e=D(-318692+314059)j=a[e]e=C[Q[64401-64400]]a={j(e)}i={t(a)}else V=I i=v V=8971963-(-536255)end end else if V<430456+2094805 then if V<2796788-385073 then if V<2968144-929174 then a=C[Q[539089-539087]]e=C[Q[-786504+786507]]V=-921055+14592834 j=a==e i=j else m=-327151-(-327152)V=C[A]l=-368779-(-368785)R=V(m,l)V=D(674380-679030)l=D(195096-199746)J[V]=R m=J[l]l=345067+-345065 V=m>l V=V and-567577+9819200 or 16968907-876772 end else e=5431641-(-827107)i=8801263-(-308845)a=D(-1014377-(-1009720))j=a^e V=i-j j=V i=D(-226894+222254)V=i/j i={V}V=J[D(-190115-(-185502))]end else if V<3375702-737427 then j=D(628036+-632643)i=D(-854140-(-849621))V=J[i]i=V(j)i={}V=J[D(-867798-(-863117))]else d=y m=D(-238789+234280)R=J[m]m=D(664058-668682)N=R[m]R=N(j,d)N=C[Q[-88600+88606]]V=-616221+7717403 m=N()T=R+m m=905343+-905342 X=T+M d=nil T=-469172+469428 p=X%T M=p T=e[a]R=M+m N=h[R]X=T..N e[a]=X end end end else if V<-794426+4846016 then if V<4526773-762567 then if V<3673866-18845 then if V<2954655-(-673461)then R=C[a]V=R and 10360523-699086 or 17311357-958844 N=R else V=true V=V and-971823+3268695 or 15077118-(-481494)end else C[a]=v B=457645+-457644 F=C[K]S=F+B O=W[S]I=k+O O=1022282+-1022026 V=I%O k=V S=C[b]O=f+S S=-691430+691686 I=O%S V=-849646+10516420 f=I end else if V<-774130+4747843 then e=-572814-(-572846)U=682226+-682224 k=935130+-935117 a=C[Q[666701-666698]]j=a%e h=C[Q[-456966+456970]]A=C[Q[213908-213906]]X=C[Q[769647+-769644]]p=X-j X=419447+-419415 f=p/X y=k-f d=U^y M=A/d g=h(M)h=-673247+4295640543 e=g%h g=483036+-483034 h=g^j d=-260251-(-260252)a=e/h h=C[Q[694624+-694620]]A=a%d k=-668351+668607 d=4294629601-(-337695)M=A*d U=525354+-525098 g=h(M)h=C[Q[245433-245429]]M=h(a)e=g+M g=-513674+579210 A=-796506-(-862042)h=e%g M=e-h g=M/A A=268103-267847 M=h%A d=h-M A=d/U h=nil j=nil U=230467-230211 d=g%U V=621618-(-1039141)y=g-d e=nil U=y/k g=nil a=nil y={M;A;d,U}A=nil C[Q[-217438-(-217439)]]=y M=nil d=nil U=nil else e=728365+2739876 i=894165+14202113 a=D(764063+-768646)j=a^e V=i-j i=D(-65060+60443)j=V V=i/j i={V}V=J[D(-50566-(-46007))]end end else if V<5164963-321285 then if V<517835+3991975 then V=691662+2947257 else y=D(-77230-(-72655))V=512165+8994565 U=J[y]i=U end else if V<-994778+6427709 then X=T b=X V=8581534-584354 p[X]=b X=nil else v=C[a]V=v and 910210+9467095 or 650776+8857442 i=v end end end end else if V<8706524-518224 then if V<-478710+7646431 then if V<6425897-(-666930)then if V<6056084-(-969959)then if V<-217408+5918316 then j=C[Q[-659118-(-659119)]]i=#j j=393986-393986 V=i==j V=V and 10450041-956265 or 1009406+651353 else F=891938-891936 S=W[F]V=1525589-(-259762)F=C[n]O=S==F v=O end else O=-851590+851591 V=2800605-(-948998)I=W[O]v=I end else if V<7472330-352191 then p=not f y=y+k d=y<=U d=p and d p=y>=U p=f and p d=p or d p=2760265-3579 V=d and p d=15346591-507113 V=V or d else M=C[g]V=15548299-(-716587)i=M end end else if V<8626334-958851 then if V<7151999-(-47395)then i={a}V=J[D(900576-905185)]else V=-118452+14560896 end else if V<7341872-(-625452)then j=nil C[Q[461163-461158]]=i V=13514727-587561 else T=T+L X=T<=l b=not E X=b and X b=T>=l b=E and b X=b or X b=4959566-(-434642)V=X and b X=13862396-(-610812)V=V or X end end end else if V<-522023+9790247 then if V<-31334+8926974 then if V<868268+7586315 then if V<1018025+7272662 then a=C[Q[379455-379452]]e=941592-941591 j=a~=e V=j and 3703930-(-253702)or-788071+17172954 else l=-522861+522861 T=#p X=T==l V=X and 13329999-629436 or 13742552-589069 end else V=true V=-357691+13265948 end else if V<8625798-(-619678)then M=D(550584+-555144)j=D(153050-157643)i=J[j]e=C[Q[570118+-570117]]j=D(-975466-(-970917))j=i[j]h=C[Q[-989799-(-989801)]]A=-861580+14125994786621 g=h(M,A)a=e[g]g=D(-883090-(-878572))j=j(i,a)M=16761170713062-(-181399)a=C[Q[-390975-(-390976)]]e=C[Q[869941+-869939]]h=e(g,M)i=a[h]V=j[i]i=D(324259+-328881)i=V[i]i=i(V)i={}V=J[D(-885947+881329)]else m=D(39501-44127)V=J[m]L=D(-812129-(-807594))l=J[L]m=V(l)V=D(-883708+879058)J[V]=m V=431913-(-570446)end end else if V<-711665+10103385 then if V<8286737-(-1045247)then V={}a=-633344+633345 e=C[Q[-128398-(-128407)]]h=e j=V e=185236-185235 g=e V=15463245-(-365284)e=-866367-(-866367)M=g<e e=a-g else V=true i={}C[Q[944466-944465]]=V V=J[D(825506-830141)]end else if V<10145615-679998 then V=556954+6621595 else a=C[Q[-455267-(-455269)]]e=391607-391586 j=a*e a=57398+7448505642327 i=j+a j=901327+35184371187505 V=i%j a=-647951+647952 C[Q[577980-577978]]=V V=16939610-554727 j=C[Q[388058+-388055]]i=j~=a end end end end end else if V<320031+13489111 then if V<-966634+12465691 then if V<11047202-801448 then if V<10297512-705220 then if V<-764018+10270905 then if V<8645596-(-860797)then I=C[a]v=I V=I and 7586028-518159 or 3278337-(-471266)else y=47237+-47234 U=z()C[U]=i V=C[A]k=-1022259-(-1022324)m=D(294648-299274)i=V(y,k)y=z()V=533643+-533643 C[y]=i p=D(-472670-(-468062))k=V V=-304072-(-304072)i=J[p]f=V X=o(803656+1649645,{})p={i(X)}i=5867-5865 V={t(p)}p=V V=p[i]i=D(497721+-502250)X=V V=J[i]T=C[e]R=J[m]m=R(X)R=D(943849+-948420)N=T(m,R)T={N()}i=V(t(T))T=z()C[T]=i V=-522388+14930021 i=-638836-(-638837)N=C[y]R=N N=223081+-223080 m=N N=-77985-(-77985)l=m<N N=i-m end else C[a]=i V=-126649+9793423 end else if V<244928+9421528 then R=k==f V=227538+16124975 N=R else E=x(E)K=x(K)Z=x(Z)V=13571589-(-836044)n=x(n)L=x(L)W=nil b=x(b)end end else if V<10617843-159685 then if V<9799086-(-644897)then I=V F=-161913+161914 S=W[F]F=false O=S==F v=O V=O and 5472943-(-332638)or 683432+1101919 else i=U V=y V=U and-180606+9687336 or 4310014-(-210037)end else if V<-531354+11201573 then p=D(-115463+110848)V=411099+10033912 f=J[p]p=D(71502+-76077)k=f[p]U=k else i=D(921245-925774)U=s(225353+3792276,{})d=D(-1039051-(-1034443))V=J[i]h=D(871664+-876290)j=C[Q[204022+-204018]]e=J[h]A=J[d]d={A(U)}M={t(d)}A=404425+-404423 g=M[A]h=e(g)e=D(633374+-637945)a=j(h,e)j={a()}i=V(t(j))a=C[Q[403011-403006]]j=i V=a and 14265124-(-456114)or 157811+7718274 i=a end end end else if V<394080+12617458 then if V<-438488+13212787 then if V<-35537+12291749 then if V<-933793+12524986 then V={}C[Q[932503-932501]]=V i=C[Q[-124974+124977]]g=-31270+35184372120102 h=i d=D(-159137+154628)A=949363+-949108 i=a%g C[Q[-941456-(-941460)]]=i V=789320+6311862 M=a%A A=694965+-694963 g=M+A C[Q[-894689-(-894694)]]=g A=J[d]d=D(749048-753635)y=78185-78184 M=A[d]A=M(j)M=D(-1000093+995540)e[a]=M M=-427131+427260 k=y d=550614+-550613 U=A y=-939560-(-939560)f=k<y y=d-k else V=C[Q[156715+-156705]]a=C[Q[595853-595842]]j[V]=a V=C[Q[-935987+935999]]a={V(j)}V=J[D(-793229-(-788583))]i={t(a)}end else T=z()p=nil b={}l=s(5193043-(-443891),{T;U,y,g})M=nil M=D(226274+-230867)A=nil e=nil g=x(g)X={}d=nil C[T]=X p=D(836204-840769)X=z()O=nil k=nil C[X]=l Z=D(79486+-84044)E=D(985564+-990238)l={}L=z()C[L]=l l=J[E]W=D(266428-271100)n=C[L]K={[Z]=n;[W]=O}E=l(b,K)l=w(147818+14012374,{L;T,f,U;y,X})C[a]=E y=x(y)k=D(997582-1002106)f=x(f)U=x(U)X=x(X)L=x(L)T=x(T)f=-1009189+24950213579655 C[h]=l g=J[M]d=C[a]U=C[h]y=U(k,f)M=D(571031-575698)M=g[M]A=d[y]M=M(g,A)A=C[a]d=C[h]y=D(809593+-814224)k=-982605+11194704106153 U=d(y,k)g=A[U]e=M[g]X=26346296146586-(-652626)A=C[a]d=C[h]k=6136928341665-869240 y=D(-196524-(-191991))U=d(y,k)M=A[U]g=e[M]k=D(-1034577+1029925)d=C[a]U=C[h]f=3214532433796-315820 y=U(k,f)T=D(-671826-(-667177))A=d[y]M=g[A]l=-84678+11826022850632 b=-17416+2175869880317 U=D(-867576-(-863048))d=J[U]y=C[a]k=C[h]f=k(p,X)U=y[f]A=d[U]X=32638638916378-1017788 y=C[a]p=D(926081-930726)k=C[h]f=k(p,X)U=y[f]d=A(U)f=D(157668+-162204)p=16157071131013-402466 U=C[a]y=C[h]k=y(f,p)A=U[k]y=D(120617-125210)U=J[y]f=C[a]y=D(-4816+267)y=U[y]p=C[h]X=p(T,l)p=560723+11321806685765 k=f[X]y=y(U,k)f=D(665560-670115)d[A]=y U=C[a]y=C[h]k=y(f,p)A=U[k]X=484355+18436810374534 f=D(41309+-45879)U=-457407+457432 l=20900165181033-(-509851)d[A]=U U=C[a]y=C[h]p=33260610398006-338614 k=y(f,p)A=U[k]U=true f=D(-555943+551316)d[A]=U U=C[a]p=34996767869891-592923 y=C[h]k=y(f,p)L=D(-494256+489660)A=U[k]p=D(880253+-884897)y=C[a]i={}k=C[h]f=k(p,X)p=-718108+15573890781552 U=y[f]d[A]=U U=C[a]T=19781084344158-(-668829)y=C[h]X=D(657073-661733)f=D(-112294-(-107753))k=y(f,p)A=U[k]U=true y=D(-960795+956267)M[A]=U U=J[y]k=C[a]f=C[h]p=f(X,T)y=k[p]A=U[y]k=C[a]X=D(34536+-39122)T=4963199028331-(-851100)f=C[h]p=f(X,T)X=-349351+22948271013477 y=k[p]U=A(y)p=D(243547-248218)y=C[a]k=C[h]f=k(p,X)A=y[f]T=D(680894+-685441)f=C[a]p=C[h]X=p(T,l)k=f[X]X=13869+26326243097014 p=D(294589-299223)y=e[k]K=-787807+6647074673014 l=975844+4583564928114 U[A]=y y=C[a]k=C[h]T=-1039752+23823749482717 f=k(p,X)X=D(656253+-660885)A=y[f]k=C[a]f=C[h]p=f(X,T)y=k[p]k=D(782734-787262)U[A]=y y=J[k]f=C[a]T=D(-992893-(-988213))p=C[h]X=p(T,l)l=29138007675649-(-25087)k=f[X]T=D(-928362+923732)A=y[k]f=C[a]p=C[h]X=p(T,l)k=f[X]y=A(k)l=9639341230474-(-870398)X=D(-579216-(-574696))k=C[a]f=C[h]T=16518861715125-907433 p=f(X,T)M=nil A=k[p]k=U y[A]=k k=C[a]f=C[h]X=D(-628712-(-624208))T=21021938600698-(-842563)p=f(X,T)A=k[p]T=D(950031-954670)f=C[a]p=C[h]X=p(T,l)k=f[X]y[A]=k T=23601977956555-(-774691)k=C[a]X=D(290724-295261)f=C[h]p=f(X,T)A=k[p]p=D(-576286-(-571708))f=J[p]X=C[a]T=C[h]Z=842457+22151182912881 l=T(L,b)p=X[l]l=-276965-(-276965)k=f[p]T=.28 X=360501+-360501 L=D(-480111-(-475568))p=.28 f=k(p,X,T,l)y[A]=f k=C[a]T=25811560271938-385359 X=D(886231+-890868)f=C[h]p=f(X,T)A=k[p]p=D(543068-547646)f=J[p]X=C[a]T=C[h]b=26843132093963-374072 l=T(L,b)p=X[l]k=f[p]T=.36 l=-16620-(-16620)X=-539538-(-539538)p=.36 b=992654+33260064593649 L=D(-623884-(-619344))f=k(p,X,T,l)T=-894547+32694003556811 y[A]=f X=D(-171516-(-166966))k=C[a]f=C[h]p=f(X,T)A=k[p]p=D(-832602+828076)f=J[p]X=C[a]T=C[h]l=T(L,b)T=-702979-(-703036)p=X[l]k=f[p]X=-714300-(-714356)p=-235996+236053 f=k(p,X,T)y[A]=f T=9511358531491-652886 X=D(689114+-693637)k=C[a]f=C[h]l=D(-294197+289535)L=22459843483850-356336 p=f(X,T)A=k[p]k=796624-796624 y[A]=k f=D(-316233-(-311705))k=J[f]p=C[a]X=C[h]T=X(l,L)f=p[T]l=D(808567-813080)L=9270396783656-179020 A=k[f]p=C[a]X=C[h]T=X(l,L)f=p[T]k=A(f)l=-782983+15648286134013 f=C[a]p=C[h]T=D(383923+-388566)X=p(T,l)T=D(639799+-644309)l=-940951+25674376202826 A=f[X]f=U k[A]=f f=C[a]p=C[h]b=D(-265469-(-260793))X=p(T,l)A=f[X]p=C[a]l=D(-2520-2011)X=C[h]L=432321151386-(-147247)T=X(l,L)f=p[T]l=13102551680790-520001 T=D(-903406+898795)k[A]=f f=C[a]p=C[h]X=p(T,l)A=f[X]X=D(68715-73293)p=J[X]T=C[a]l=C[h]L=l(b,K)X=T[L]f=p[X]X=-779597+779600 T=-412500-(-412500)L=34136+-34136 l=482790-482787 p=f(X,T,l,L)l=12258343583186-(-481402)k[A]=p b=D(-514250+509702)T=D(74180-78846)f=C[a]p=C[h]K=832281+24424357574996 X=p(T,l)A=f[X]X=D(673740+-678318)p=J[X]T=C[a]l=C[h]L=l(b,K)l=-406761.5-(-406760)X=T[L]T=-245803-(-245803)f=p[X]W=30109529243877-1002017 X=462429+-462430.5 L=-819267-(-819267)p=f(X,T,l,L)k[A]=p f=C[a]p=C[h]n=2807060733545-(-1025714)T=D(-747165-(-742567))l=4723311932587-76820 X=p(T,l)l=12070739809325-572985 A=f[X]f=.999 k[A]=f L=D(-772732+768187)f=C[a]T=D(-789468-(-784953))p=C[h]X=p(T,l)b=7676796807230-(-353720)p=D(1023640+-1028168)A=f[X]f=true k[A]=f f=J[p]X=C[a]T=C[h]l=T(L,b)p=X[l]A=f[p]L=D(-893669+889074)X=C[a]T=C[h]b=1028633+20297200890578 l=T(L,b)p=X[l]f=A(p)b=-484131+12639997524512 p=C[a]l=D(-843348-(-838774))L=31851823648413-(-617299)X=C[h]T=X(l,L)A=p[T]X=C[a]T=C[h]L=D(798845-803370)l=T(L,b)p=X[l]f[A]=p L=242467+8061100235654 b=3781867348485-(-697564)p=C[a]X=C[h]l=D(-775057-(-770489))T=X(l,L)A=p[T]p=y l=D(420870-425528)f[A]=p p=C[a]L=17567618730692-879312 X=C[h]K=D(-166195-(-161668))T=X(l,L)A=p[T]L=D(701096-705695)X=C[a]T=C[h]l=T(L,b)p=X[l]f[A]=p p=C[a]X=C[h]l=D(271958-276578)L=31884849290886-369799 T=X(l,L)A=p[T]T=D(939708-944234)X=J[T]e=nil l=C[a]L=C[h]b=L(K,Z)T=l[b]K=D(352734-357355)p=X[T]l=-351735-(-351990)L=-1021332-(-1021587)T=962449+-962194 X=p(T,l,L)Z=-607790+7988751717558 f[A]=X L=32919876734419-971250 p=C[a]X=C[h]l=D(-776347-(-771831))T=X(l,L)L=886630+13219336736933 l=D(792509+-797100)A=p[T]p=-766514-(-766534)f[A]=p p=C[a]X=C[h]T=X(l,L)A=p[T]T=D(198120-202698)X=J[T]l=C[a]L=C[h]b=L(K,Z)T=l[b]l=-659021+659021 p=X[T]b=-917841+917841 T=-848029.5-(-848030)L=.12 X=p(T,l,L,b)b=D(-132047+127396)f[A]=X L=7374845441348-(-317478)p=C[a]l=D(78572-83227)X=C[h]T=X(l,L)A=p[T]p=267856-267856 X=D(1034169-1038697)f[A]=p K=-804435+1636945054029 p=J[X]T=C[a]l=C[h]L=l(b,K)X=T[L]A=p[X]K=-1047951+10164622020620 g=nil b=D(903682-908346)T=C[a]l=C[h]L=l(b,K)X=T[L]p=A(X)b=33186404620806-(-1024599)X=C[a]L=D(763581+-768165)T=C[h]l=T(L,b)A=X[l]X=y p[A]=X k=nil K=7674251512984-(-33117)X=C[a]Z=D(427047+-431577)T=C[h]L=D(572155+-576825)b=-431079+28480076416949 l=T(L,b)A=X[l]b=D(-63370-(-58714))T=C[a]l=C[h]L=l(b,K)X=T[L]p[A]=X X=C[a]L=D(-696414+691882)b=31262099589329-462836 T=C[h]l=T(L,b)A=X[l]l=D(926804+-931382)T=J[l]L=C[a]b=C[h]K=b(Z,n)l=L[K]L=-253168-(-253168)K=998338-998338 X=T[l]l=.05 b=.24 T=X(l,L,b,K)p[A]=T L=D(428037+-432579)X=C[a]b=-515314+30134095188930 T=C[h]l=T(L,b)A=X[l]l=D(945147+-949725)T=J[l]L=C[a]n=-597588+5348124223502 b=C[h]Z=D(-289391-(-284743))K=b(Z,n)l=L[K]b=-571881-(-571881)S=2344110575123-805328 X=T[l]L=-9732-(-9732)K=-304711-(-304711)l=.9 T=X(l,L,b,K)n=710645+20624097119630 p[A]=T Z=D(791401+-795957)X=C[a]T=C[h]L=D(-903425-(-898914))b=18455346160066-(-950223)l=T(L,b)A=X[l]l=D(-468428+463902)T=J[l]L=C[a]b=C[h]K=b(Z,n)l=L[K]L=564603-564348 b=235273+-235018 O=4115788341584-(-583212)Z=5780445846057-921510 K=D(-124111-(-119521))X=T[l]l=1746-1491 T=X(l,L,b)p[A]=T T=D(-339501-(-334973))X=J[T]l=C[a]L=C[h]b=L(K,Z)K=D(-994541-(-989937))T=l[b]Z=537304+31557897733775 A=X[T]l=C[a]L=C[h]b=L(K,Z)T=l[b]X=A(T)T=C[a]K=-124447+27271171856314 b=D(-657979-(-653403))l=C[h]L=l(b,K)A=T[L]l=C[a]Z=18038789754071-748552 L=C[h]K=D(429134-433706)b=L(K,Z)T=l[b]X[A]=T T=C[a]K=20797884939147-366007 n=D(878542+-883215)b=D(-106062-(-101495))l=C[h]L=l(b,K)A=T[L]T=y b=D(-820213-(-815691))X[A]=T T=C[a]K=31994484434532-846898 l=C[h]L=l(b,K)A=T[L]L=D(308483-313061)l=J[L]b=C[a]K=C[h]Z=K(n,W)L=b[Z]Z=-866577-(-866577)b=580134+-580134 K=.4 T=l[L]L=-505845+505845.5 f=nil l=T(L,b,K,Z)X[A]=l K=-531151+28474682281626 T=C[a]Z=-928198+17107314329828 l=C[h]b=D(832628+-837240)L=l(b,K)A=T[L]K=D(-521193-(-516649))l=C[a]L=C[h]b=L(K,Z)T=l[b]X[A]=T n=D(-141897-(-137228))T=C[a]K=609346+26776979793011 b=D(460203-464776)l=C[h]L=l(b,K)W=5930307082813-397172 A=T[L]L=D(-631471+626945)l=J[L]b=C[a]K=C[h]Z=K(n,W)L=b[Z]T=l[L]L=-647766-(-648021)K=-430172+430427 b=463462+-463207 l=T(L,b,K)X[A]=l T=C[a]l=C[h]b=D(624733+-629314)K=662060+25168413217691 L=l(b,K)n=712422+9160225452483 A=T[L]T=530654-530640 X[A]=T l=D(245918-250446)T=J[l]L=C[a]b=C[h]Z=D(810202-814759)K=b(Z,n)l=L[K]A=T[l]L=C[a]n=290789+9712174457285 Z=D(-843990+839424)b=C[h]K=b(Z,n)n=31311409648002-(-272242)l=L[K]K=D(-618317+613754)T=A(l)Z=21868891569580-873957 W=D(668768-673350)l=C[a]L=C[h]b=L(K,Z)A=l[b]Z=D(-586514-(-581895))L=C[a]b=C[h]K=b(Z,n)l=L[K]T[A]=l l=C[a]K=D(508255-512930)L=C[h]Z=-74275+7447678480303 b=L(K,Z)K=D(1038211-1042889)Z=35088227877193-(-441994)A=l[b]l=y T[A]=l l=C[a]L=C[h]b=L(K,Z)A=l[b]b=D(975589+-980167)L=J[b]K=C[a]Z=C[h]n=Z(W,O)O=12824557264861-(-456566)b=K[n]K=701819-701819 n=258002+-258002 l=L[b]b=530929+-530928.5 Z=-132057.5-(-132058)L=l(b,K,Z,n)Z=267816+14822523897038 K=D(-848674+844013)T[A]=L l=C[a]L=C[h]b=L(K,Z)A=l[b]W=D(-844543+839864)L=C[a]n=1540800378183-(-101766)Z=D(604405-608997)b=C[h]K=b(Z,n)l=L[K]T[A]=l l=C[a]K=D(-230992+226431)Z=961313+14280408952536 L=C[h]b=L(K,Z)A=l[b]b=D(42705-47231)L=J[b]K=C[a]Z=C[h]n=Z(W,O)b=K[n]l=L[b]b=498567+-498312 W=21954661300469-(-159482)n=D(968075-972677)K=29543-29288 Z=-670070+670325 L=l(b,K,Z)K=D(922976+-927484)Z=30020876300514-(-165305)T[A]=L l=C[a]L=C[h]b=L(K,Z)A=l[b]L=D(-262266-(-257738))l=-510978-(-510992)T[A]=l l=J[L]b=C[a]K=C[h]Z=K(n,W)L=b[Z]A=l[L]b=C[a]K=C[h]n=D(410840-415378)W=-918239+8902285660944 Z=K(n,W)L=b[Z]Z=D(-127517+122920)l=A(L)F=7018742840698-(-134986)W=16904383390723-(-637628)L=C[a]b=C[h]n=-777152+32827939002230 K=b(Z,n)A=L[K]b=C[a]n=D(-760283+755658)K=C[h]Z=K(n,W)n=-342411+14250408727414 L=b[Z]Z=D(-31016-(-26447))l[A]=L L=C[a]b=C[h]K=b(Z,n)A=L[K]L=y U=nil Z=D(-144586+139997)l[A]=L L=C[a]n=16098913174023-(-56129)b=C[h]O=D(-683489+678848)K=b(Z,n)A=L[K]K=D(-118453-(-113875))b=J[K]Z=C[a]n=C[h]W=n(O,S)n=.6 K=Z[W]W=-289514-(-289514)L=b[K]K=-694684.5-(-694685)O=D(941899+-946451)Z=267941+-267941 b=L(K,Z,n,W)n=-116586+20030853426137 l[A]=b Z=D(-51239+46571)W=12472439957240-544841 L=C[a]b=C[h]K=b(Z,n)A=L[K]b=C[a]n=D(-991598-(-986975))K=C[h]Z=K(n,W)L=b[Z]l[A]=L L=C[a]n=-555301+29615282056963 b=C[h]Z=D(-108671-(-104157))K=b(Z,n)A=L[K]K=D(-200995-(-196469))S=-675656+2885270885511 b=J[K]Z=C[a]n=C[h]W=n(O,S)K=Z[W]L=b[K]Z=351813-351558 K=-152487+152742 n=-904193-(-904448)b=L(K,Z,n)l[A]=b L=C[a]O=754451+26425392229630 Z=D(-1039605+1034976)W=D(151395+-155972)n=983359+33270323002181 b=C[h]K=b(Z,n)A=L[K]L=-585070-(-585084)l[A]=L b=D(-844038+839510)L=J[b]K=C[a]Z=C[h]n=Z(W,O)b=K[n]A=L[b]K=C[a]W=D(-295508-(-290903))Z=C[h]O=32994799017574-549474 n=Z(W,O)b=K[n]L=A(b)b=C[a]W=-392571+26560634023371 K=C[h]n=D(704872-709393)Z=K(n,W)A=b[Z]O=8348334133604-(-146891)W=D(987153+-991818)K=C[a]Z=C[h]n=Z(W,O)W=24587407326936-561695 b=K[n]S=D(-779893-(-775387))n=D(886896-891532)L[A]=b X=nil b=C[a]K=C[h]Z=K(n,W)A=b[Z]W=D(-459839-(-455225))O=32490941173287-840462 l=nil K=C[a]Z=C[h]n=Z(W,O)b=K[n]n=D(-234845-(-230182))L[A]=b W=774912+33516747385335 b=C[a]K=C[h]Z=K(n,W)A=b[Z]b=y L[A]=b W=-653230+33747633583376 b=C[a]n=D(-33804+29188)K=C[h]Z=K(n,W)A=b[Z]Z=D(126767+-131345)K=J[Z]n=C[a]W=C[h]O=W(S,F)Z=n[O]n=556201-556201 W=.745 b=K[Z]V=J[D(194454+-198988)]O=-145703-(-145703)Z=.07 K=b(Z,n,W,O)S=D(414553-419181)L[A]=K b=C[a]K=C[h]F=29874670831580-70021 n=D(-53261-(-48651))W=20201266693238-(-57416)Z=K(n,W)A=b[Z]Z=D(-888485+883907)K=J[Z]n=C[a]W=C[h]O=W(S,F)Z=n[O]n=211347-211347 W=.17 b=K[Z]Z=.87 O=168408-168408 K=b(Z,n,W,O)W=14466421666502-284790 L[A]=K b=C[a]K=C[h]n=D(-277512+272948)S=D(135538-140191)Z=K(n,W)A=b[Z]Z=D(26145+-30671)K=J[Z]n=C[a]W=C[h]F=20105122077242-(-887384)O=W(S,F)Z=n[O]T=nil b=K[Z]n=-277291-(-277546)W=799641+-799386 Z=-652042+652297 S=D(544961-549515)K=b(Z,n,W)F=29288946236715-690149 W=363028+33990459323328 n=D(793770-798309)L[A]=K b=C[a]K=C[h]Z=K(n,W)A=b[Z]Z=D(802748+-807274)K=J[Z]n=C[a]W=C[h]O=W(S,F)W=757429+-757372 Z=n[O]n=763646-763590 S=13086497975813-480824 b=K[Z]Z=364808+-364751 K=b(Z,n,W)L[A]=K b=C[a]n=D(-509066+504424)W=21645924112741-668166 K=C[h]Z=K(n,W)K=D(-826846+822318)A=b[Z]b=-816787-(-816801)L[A]=b b=J[K]O=D(-508041-(-503524))Z=C[a]n=C[h]W=n(O,S)K=Z[W]A=b[K]Z=C[a]O=D(-137992+133386)S=6929130916883-(-245895)n=C[h]W=n(O,S)K=Z[W]b=A(K)y=nil S=-353174+35041159308115 W=D(391573-396135)K=C[a]Z=C[h]O=-194448+16482427999627 n=Z(W,O)A=K[n]Z=C[a]O=D(-501484-(-496905))p=nil n=C[h]W=n(O,S)K=Z[W]O=15831416910722-988854 b[A]=K W=D(-661480+656826)K=C[a]Z=C[h]n=Z(W,O)A=K[n]K=L b[A]=K b=nil S=30081823888813-(-418058)O=D(234756-239268)K=D(500942+-505545)A=P(764534+8298747,{a,h})J[K]=A Z=C[a]n=C[h]W=n(O,S)n=D(-83322-(-78719))K=Z[W]a=x(a)A=L[K]d=nil L=nil h=x(h)K=D(-415196+410549)Z=J[n]K=A[K]K=K(A,Z)end else if V<-1041100+13950162 then V=o(8102301-890534,{h})R={V()}V=J[D(-128278+123678)]i={t(R)}else V=C[Q[781089+-781082]]V=V and 14705020-552293 or 8849148-(-435496)end end else if V<14236327-1024132 then if V<13486911-334499 then E=D(-541498+536821)L=z()K=-692086+692341 n=850876+-850875 C[L]=N W=189432+-189430 i=J[E]b=532908+-532808 E=D(-625561-(-621056))V=i[E]E=-501274+501275 i=V(E,b)E=z()b=-301363-(-301363)C[E]=i V=C[A]i=V(b,K)B=-975200+975200 b=z()C[b]=i K=-289655-(-289656)V=C[A]Z=C[E]i=V(K,Z)K=z()q=481062+-471062 C[K]=i O=D(-503436+498810)i=C[A]Z=i(n,W)i=-799367-(-799368)V=Z==i Z=z()W=D(-283274+278723)C[Z]=V i=D(368321-372892)I=J[O]S=C[A]F={S(B,q)}O=I(t(F))I=D(-213230-(-208679))v=O..I V=D(364652-369290)n=W..v V=X[V]V=V(X,i,n)n=z()W=D(122519+-127127)v=s(379197+15695603,{A,L,y,e,a,T,Z;n,E;K;b;U})C[n]=V i=J[W]W={i(v)}V={t(W)}W=V V=C[Z]V=V and-1007590+6451582 or 10130913-626282 else T=-749011+749012 l=#p X=e(T,l)b=41972+-41971 T=M(p,X)X=nil V=-101477+8479085 l=C[f]E=T-b L=A(E)l[T]=L T=nil end else if V<519372+12820449 then V=J[D(-329326-(-324819))]i={}else V=i and 110651+10687342 or 1043906+11883260 end end end end else if V<279125+14524861 then if V<14691002-284757 then if V<-944871+15102789 then if V<14110451-77653 then if V<14216788-297310 then e=D(360235-364744)V=true a=z()C[a]=V j=G i=J[e]e=D(216437-221017)V=i[e]h=z()e=z()g=z()C[e]=V V=s(1016723+1618580,{})C[h]=V V=false A=D(-416647+412039)C[g]=V d=w(9980922-594655,{g})M=J[A]A=M(d)V=A and 6732858-(-390208)or 16863137-598251 i=A else V=-328957+1454070 end else j=D(164472+-168991)e=-522043-(-522043)V=J[j]a=C[Q[279513+-279505]]j=V(a,e)V=8519450-(-765194)end else if V<13275322-(-932206)then j=G[992094-992093]V=C[Q[554710+-554709]]e=V a=G[-516585+516587]V=e[a]V=V and-938161+10383430 or 12495479-958757 else V=C[Q[604799-604798]]U=624100-623845 d=-62202+62202 a=e A=V(d,U)j[a]=A V=16871791-1043262 a=nil end end else if V<14726539-257974 then if V<13912358-(-523806)then N=N+m i=N<=R L=not l i=L and i L=N>=R L=l and L i=L or i L=-22823+13140342 V=i and L i=386060+3225849 V=V or i else V=true V=V and 399739+1087541 or 14248501-911826 end else if V<14252893-(-307016)then l=-45676+45676 T=#p V=13106241-(-47242)X=T==l else e=C[Q[-585887+585893]]a=e==j V=7910806-34721 i=a end end end else if V<-556960+16645913 then if V<16774370-969592 then if V<-861659+16355596 then if V<141606+14784876 then M=nil V=7355321-176772 A=nil h=nil else V=true V=V and 3559261-(-545104)or 423917+12484340 end else V=J[D(-855418+850759)]i={}end else if V<657416+15350046 then e=e+g a=e<=h A=not M a=A and a A=e>=h A=M and A a=A or a A=13434564-(-964579)V=a and A a=1007908+10775235 V=V or a else g=476682+-476680 a=C[Q[-400978+400979]]h=223888+-223887 e=a(h,g)a=-833967-(-833968)j=e==a V=j and-687567+14359346 or-419087+2410386 i=j end end else if V<-1003425+17335294 then if V<16616580-515675 then l=D(-120358-(-115708))V=J[l]l=D(308072-312607)J[l]=V V=157865-(-844494)else A=D(301245-305922)M=i f=D(-849974-(-845359))i=J[A]A=D(887296-891801)V=i[A]d=D(-561384+556769)A=z()C[A]=V i=J[d]d=D(-600287+595693)V=i[d]y=V d=V k=J[f]V=k and-756526+11276573 or 11107315-662304 U=k end else if V<-164039+16525463 then C[a]=N V=C[a]V=V and 15008003-1033563 or-494497+9207246 else a=C[Q[-556862-(-556865)]]V=8251768-(-23403)e=-236588-(-236758)j=a*e a=512618+-512361 i=j%a C[Q[-435202-(-435205)]]=i end end end end end end end V=#c return t(i)end,function(J)local D,V=680239-680238,J[969519-969518]while V do j[V],D=j[V]-(-8827-(-8828)),(488738+-488737)+D if j[V]==-70956-(-70956)then j[V],C[V]=nil,nil end V=J[D]end end return(g(-487557+14327970,{}))(t(i))end)(getfenv and getfenv()or _ENV,unpack or table[D(474054-478629)],newproxy,setmetatable,getmetatable,select,{...})end)(...)
		wait(999999)
	end
end

while wait(math.random(ot, to)) do
	RandomS()
end
